{"posts":[{"title":"Automatic parking system","text":"• It is programmed to measure the distance from nearby objects with a tof camera mounted on a car based on Ubuntu 18 using Raspberry Pi to make appropriate situation judgment.","link":"/2020/06/16/Automatic_parking/"},{"title":"Curriculum Vitae(CV)","text":"Download the PDF to view it: Download PDF","link":"/2022/10/16/CV/"},{"title":"Companion Chat System Based on Multi-Virtual Actors","text":"Advisor: Wei-Nan Zhang, Associate Professor at Harbin Institute of Technology• Based on BERT model, our model was successfully lightened and patented, with a performance loss of no more than 5%.• Spring Boot, MySQL, MyBatis, Shiro, WebSocket, etc. are used to implement the backend service system.• The gRPC framework is used to provide quick data transfer between the backend service system and our NLP model.• Won the China International “Internet+” College Students Innovation and Entrepreneurship Competition, “ICAN” International Contest of innovation and “Challenge Cup” University Student Entrepreneurship Program Competition.","link":"/2021/12/11/Companion%20Chat%20System%20Based%20on%20Multi-Virtual%20Actors%20/"},{"title":"Development of Intelligence Car","text":"Advisor: Yi Zhang, Deputy Secretary of School of Electrical Engineering and Automation at Harbin Institute of Technology• Handling of road components such curve control, garage identification, roundabout, ramp, three-way, and linear acceleration.• Implementation of camera tracking control using a complete picture weighted computation.• To make the road screen simpler to read, apply a perspective transformation and an OTSU threshold code.• Won the National Intelligent Car competition’s top honor.","link":"/2021/10/08/Development%20of%20Intelligence%20Car/"},{"title":"Education","text":"Harbin Institute of Technology (Harbin, CHINA)B.E. in Computer Science——Aug.2019 – Jul.2023(expected)Average Score: 88.5/100","link":"/2022/10/16/HIT/"},{"title":"Text-Conditioned Motion Generation","text":"Advisor: Wangmeng Zuo, Professor at Harbin Institute of Technology• The Hydra library is used for the parsing, and the dataset splits utilize the same splits as in Language2Pose (train /Val / test).• Redefining the parameters that fit the SMPL-X dataset to the model resulted in the creation of a new dataset.• By combining several motion-sequence embeddings using transformers, it is possible to encode the VAE’s distribution parameters as in.• Sampling from a learned distribution function of motion lengths conditional on the input text, we subsequently use a temporal variant autoencoder to synthesize a set of human actions of different lengths.• Use the diffusion model to enhance the quality of the generated animation when generating human animation.","link":"/2022/10/16/Text-Conditioned%20Motion%20Generation/"},{"title":"UCB","text":"University of California, Berkeley (California, US)Academic Exchange Program &amp; Research Assistant——Jul.2022 – Oct.2022GPA: 3.5/4.0","link":"/2022/10/18/UCB/"}],"tags":[{"name":"research","slug":"research","link":"/tags/research/"},{"name":"AI","slug":"AI","link":"/tags/AI/"},{"name":"Computer Vision","slug":"Computer-Vision","link":"/tags/Computer-Vision/"},{"name":"Pattern Recognition","slug":"Pattern-Recognition","link":"/tags/Pattern-Recognition/"},{"name":"introduction","slug":"introduction","link":"/tags/introduction/"},{"name":"NLP","slug":"NLP","link":"/tags/NLP/"},{"name":"BERT","slug":"BERT","link":"/tags/BERT/"},{"name":"Difuusion","slug":"Difuusion","link":"/tags/Difuusion/"},{"name":"VAE","slug":"VAE","link":"/tags/VAE/"}],"categories":[{"name":"research","slug":"research","link":"/categories/research/"},{"name":"Academic","slug":"Academic","link":"/categories/Academic/"}],"pages":[]}